wrouwet/frdm-mcxa153-blinky/src/usb_main.c
static void I2C_Init(void)
{
    CLOCK_EnableClock(kCLOCK_GateLPI2C0);
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    RESET_ReleasePeripheralReset(kLPI2C0_RST_SHIFT_RSTn);
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);

    CLOCK_AttachClk(kFRO12M_to_LPI2C0);
    CLOCK_SetClockDiv(kCLOCK_DivLPI2C0, 1U);

    /* Enable the pins' internal pull-ups (matching NXP's own lpi2c
     * reference config for these pins). I2C needs pull-ups to work at
     * all; the internal ones are weak (~kOhm range, fine at 100 kHz) and
     * mainly matter for bench-testing this bus with nothing wired to it
     * yet -- an external target board will normally supply its own,
     * stronger pull-ups once connected. */
    const port_pin_config_t i2cPinConfig = {
        .pullSelect          = kPORT_PullUp,
        .pullValueSelect     = kPORT_LowPullResistor,
        .slewRate            = kPORT_FastSlewRate,
        .passiveFilterEnable = kPORT_PassiveFilterDisable,
        .openDrainEnable     = kPORT_OpenDrainDisable,
        .driveStrength       = kPORT_LowDriveStrength,
        .driveStrength1      = kPORT_NormalDriveStrength,
        .mux                 = kPORT_MuxAlt2,
        .inputBuffer         = kPORT_InputBufferEnable,
        .invertInput         = kPORT_InputNormal,
        .lockRegister        = kPORT_UnlockRegister,
    };
    PORT_SetPinConfig(PORT3, 27U, &i2cPinConfig);
    PORT_SetPinConfig(PORT3, 28U, &i2cPinConfig);

    lpi2c_master_config_t config;
    LPI2C_MasterGetDefaultConfig(&config);
    config.baudRate_Hz = I2C_MASTER_BAUD_HZ;
    LPI2C_MasterInit(LPI2C0, &config, I2C_MASTER_CLOCK_HZ);
}

void USB_DeviceIsrEnable(void)
{
    uint8_t usbDeviceKhciIrq[] = USBFS_IRQS;
    uint8_t irqNumber          = usbDeviceKhciIrq[CONTROLLER_ID - kUSB_ControllerKhci0];

    NVIC_SetPriority((IRQn_Type)irqNumber, USB_DEVICE_INTERRUPT_PRIORITY);
    EnableIRQ((IRQn_Type)irqNumber);
}

/*******************************************************************************
 * UART-to-I2C command bridge
 *
 * Line-based text protocol, one command per line (LF or CRLF terminated).
 * <addr> is a 7-bit I2C address, <byte> a data byte -- both 1-2 hex
 * digits, no "0x" prefix. <n> is a decimal byte count.
 *
 *   W <addr> <byte> [byte ...]     write bytes to <addr>
 *   R <addr> <n>                   read <n> bytes from <addr>
 *   X <addr> <n> <byte> [byte ...] write bytes, repeated-start, then
 *                                  read <n> bytes (register-read pattern)
 *   S                              scan the bus, list responding addresses
 *
 * Replies (also LF/CRLF terminated):
 *   OK                             W succeeded
 *   OK <byte> [byte ...]           R/X succeeded, with the read data
 *   OK <addr> [addr ...]           S succeeded (may be empty if nothing found)
 *   ERR <reason>                   something went wrong
 *
 * Example: reading 2 bytes starting at register 0x00 of a device at 0x50:
 *   > X 50 2 00
 *   < OK a1 b2
 ******************************************************************************/
/* Keep replies within one 64-byte USB full-speed packet: "OK" + N * "
 * xx" + "\r\n" must fit, so N <= 16 leaves comfortable headroom. */
#define I2C_CMD_MAX_DATA 16U

static const char *skip_spaces(const char *p)
{
    while (*p == ' ')
    {
        p++;
    }
    return p;
}

static bool parse_hex_u32(const char **pp, uint32_t *out, uint32_t maxDigits)
{
    const char *p = skip_spaces(*pp);
    uint32_t value = 0;
    uint32_t ndig  = 0;
    while (ndig < maxDigits)
    {
        char c = *p;
        uint32_t digit;
        if (c >= '0' && c <= '9')
        {
            digit = (uint32_t)(c - '0');
        }
        else if (c >= 'a' && c <= 'f')
        {
            digit = (uint32_t)(c - 'a' + 10);
        }
        else if (c >= 'A' && c <= 'F')
        {
            digit = (uint32_t)(c - 'A' + 10);
        }
        else
        {
            break;
        }
        value = (value << 4) | digit;
        ndig++;
        p++;
    }
    if (ndig == 0U)
    {
        return false;
    }
    *out = value;
    *pp  = p;
    return true;
}

static bool parse_dec_u32(const char **pp, uint32_t *out)
{
    const char *p = skip_spaces(*pp);
    uint32_t value = 0;
    uint32_t ndig  = 0;
    while (*p >= '0' && *p <= '9')
    {
        value = (value * 10U) + (uint32_t)(*p - '0');
        p++;
        ndig++;
    }
    if (ndig == 0U)
    {
        return false;
    }
    *out = value;
    *pp  = p;
    return true;
}

static uint32_t append_str(char *buf, uint32_t pos, const char *s)
{
    while (*s)
    {
        buf[pos++] = *s++;
    }
    return pos;
}

static uint32_t append_hex_byte(char *buf, uint32_t pos, uint8_t v)
{
    static const char hexdigits[] = "0123456789abcdef";
    buf[pos++]                    = hexdigits[(v >> 4) & 0xFU];
    buf[pos++]                    = hexdigits[v & 0xFU];
    return pos;
}

/* I2C_RETRY_TIMES is overridden (see Makefile) to a finite value so a
 * floating/unwired bus (no target attached, no pull-ups) fails fast with
 * kStatus_LPI2C_Timeout instead of hanging the whole command loop forever. */
static const char *i2c_error_str(status_t status)
{
    if (status == kStatus_LPI2C_Nak)
    {
        return "ERR nak";
    }
    if (status == kStatus_LPI2C_Timeout)
    {
        return "ERR timeout (check wiring/pull-ups)";
    }
    return "ERR i2c";
}

/* Processes one received command line (not including its line ending) and
 * writes a reply (not including its line ending) into outBuf. Returns the
 * reply length. outBuf must be at least DATA_BUFF_SIZE bytes. */
static uint32_t process_command(const char *line, uint32_t lineLen, char *outBuf)
{
    const char *p = skip_spaces(line);
    char cmd      = *p;
    if (cmd >= 'a' && cmd <= 'z')
    {
        cmd = (char)(cmd - 'a' + 'A');
    }
    p++;

    if (cmd != 'S' && cmd != 'W' && cmd != 'R' && cmd != 'X')
    {
        return append_str(outBuf, 0, "ERR bad command");
    }

    if (cmd == 'S')
    {
        /* Probe each address with a zero-length write, the standard I2C
         * scan idiom: it's just a START + address byte + STOP, and
         * LPI2C_MasterTransferBlocking() correctly waits for and reports
         * a NAK. (The lower-level LPI2C_MasterStart() alone does *not* --
         * it only enqueues the START command into the hardware FIFO and
         * returns, without waiting to see whether the address was
         * actually acknowledged on the bus -- so it can't be used to
         * detect a NAK by itself.) */
        uint32_t pos = append_str(outBuf, 0, "OK");
        for (uint32_t addr = 0x08U; addr <= 0x77U; addr++)
        {
            lpi2c_master_transfer_t probe = {0};
            probe.slaveAddress             = (uint16_t)addr;
            probe.direction                = kLPI2C_Write;
            probe.flags                    = kLPI2C_TransferDefaultFlag;

            if (kStatus_Success == LPI2C_MasterTransferBlocking(LPI2C0, &probe))
            {
                outBuf[pos++] = ' ';
                pos           = append_hex_byte(outBuf, pos, (uint8_t)addr);
            }
        }
        return pos;
    }

