wrouwet/frdm-mcxa153-blinky/src/usb_main.c
    uint32_t addr;
    if (!parse_hex_u32(&p, &addr, 2U) || addr > 0x7FU)
    {
        return append_str(outBuf, 0, "ERR bad address");
    }

    if (cmd == 'W' || cmd == 'X')
    {
        uint32_t readCount = 0;
        if (cmd == 'X')
        {
            if (!parse_dec_u32(&p, &readCount) || readCount > I2C_CMD_MAX_DATA)
            {
                return append_str(outBuf, 0, "ERR bad count");
            }
        }

        uint8_t data[I2C_CMD_MAX_DATA];
        uint32_t dataLen = 0;
        uint32_t byte;
        while (dataLen < I2C_CMD_MAX_DATA && parse_hex_u32(&p, &byte, 2U))
        {
            data[dataLen++] = (uint8_t)byte;
        }

        lpi2c_master_transfer_t xfer = {0};
        xfer.slaveAddress             = (uint16_t)addr;
        xfer.direction                = kLPI2C_Write;
        xfer.data                     = data;
        xfer.dataSize                 = dataLen;
        xfer.flags                    = (cmd == 'X') ? kLPI2C_TransferNoStopFlag : kLPI2C_TransferDefaultFlag;

        status_t status = LPI2C_MasterTransferBlocking(LPI2C0, &xfer);
        if (status != kStatus_Success)
        {
            return append_str(outBuf, 0, i2c_error_str(status));
        }

        if (cmd == 'W')
        {
            return append_str(outBuf, 0, "OK");
        }

        uint8_t rdata[I2C_CMD_MAX_DATA];
        lpi2c_master_transfer_t rxfer = {0};
        rxfer.slaveAddress             = (uint16_t)addr;
        rxfer.direction                = kLPI2C_Read;
        rxfer.data                     = rdata;
        rxfer.dataSize                 = readCount;
        rxfer.flags                    = kLPI2C_TransferRepeatedStartFlag;

        status = LPI2C_MasterTransferBlocking(LPI2C0, &rxfer);
        if (status != kStatus_Success)
        {
            return append_str(outBuf, 0, i2c_error_str(status));
        }

        uint32_t pos = append_str(outBuf, 0, "OK");
        for (uint32_t i = 0; i < readCount; i++)
        {
            outBuf[pos++] = ' ';
            pos           = append_hex_byte(outBuf, pos, rdata[i]);
        }
        return pos;
    }

    if (cmd == 'R')
    {
        uint32_t count;
        if (!parse_dec_u32(&p, &count) || count > I2C_CMD_MAX_DATA)
        {
            return append_str(outBuf, 0, "ERR bad count");
        }

        uint8_t rdata[I2C_CMD_MAX_DATA];
        lpi2c_master_transfer_t xfer = {0};
        xfer.slaveAddress             = (uint16_t)addr;
        xfer.direction                = kLPI2C_Read;
        xfer.data                     = rdata;
        xfer.dataSize                 = count;
        xfer.flags                    = kLPI2C_TransferDefaultFlag;

        status_t status = LPI2C_MasterTransferBlocking(LPI2C0, &xfer);
        if (status != kStatus_Success)
        {
            return append_str(outBuf, 0, i2c_error_str(status));
        }

        uint32_t pos = append_str(outBuf, 0, "OK");
        for (uint32_t i = 0; i < count; i++)
        {
            outBuf[pos++] = ' ';
            pos           = append_hex_byte(outBuf, pos, rdata[i]);
        }
        return pos;
    }

    (void)lineLen;
    return append_str(outBuf, 0, "ERR bad command");
}

/*******************************************************************************
 * CDC ACM class callback (line coding, control line state, rx/tx events)
 ******************************************************************************/
usb_status_t USB_DeviceCdcVcomCallback(class_handle_t handle, uint32_t event, void *param)
{
    uint32_t len;
    uint8_t *uartBitmap;
    usb_device_cdc_acm_request_param_struct_t *acmReqParam;
    usb_device_endpoint_callback_message_struct_t *epCbParam;
    usb_status_t error          = kStatus_USB_InvalidRequest;
    usb_cdc_acm_info_t *acmInfo = &s_usbCdcAcmInfo;
    acmReqParam                 = (usb_device_cdc_acm_request_param_struct_t *)param;
    epCbParam                   = (usb_device_endpoint_callback_message_struct_t *)param;

    switch (event)
    {
        case kUSB_DeviceCdcEventSendResponse:
            if (epCbParam->length == USB_CANCELLED_TRANSFER_LENGTH)
            {
                error = kStatus_USB_Success;
            }
            else if ((epCbParam->length != 0) &&
                     (0U == (epCbParam->length % g_UsbDeviceCdcVcomDicEndpoints[0].maxPacketSize)))
            {
                error = USB_DeviceCdcAcmSend(handle, USB_CDC_VCOM_BULK_IN_ENDPOINT, NULL, 0);
            }
            else if ((1U == s_cdcVcom.attach) && (1U == s_cdcVcom.startTransactions))
            {
                if ((epCbParam->buffer != NULL) || ((epCbParam->buffer == NULL) && (epCbParam->length == 0)))
                {
                    error = USB_DeviceCdcAcmRecv(handle, USB_CDC_VCOM_BULK_OUT_ENDPOINT, s_currRecvBuf,
                                                  g_UsbDeviceCdcVcomDicEndpoints[1].maxPacketSize);
                }
            }
            break;
        case kUSB_DeviceCdcEventRecvResponse:
            if (epCbParam->length == USB_CANCELLED_TRANSFER_LENGTH)
            {
                error = kStatus_USB_Success;
            }
            else if ((1U == s_cdcVcom.attach) && (1U == s_cdcVcom.startTransactions))
            {
                error = kStatus_USB_Success;

                bool lineDone = false;
                for (uint32_t i = 0; i < epCbParam->length && !lineDone; i++)
                {
                    char c = (char)s_currRecvBuf[i];
                    if (c == '\n')
                    {
                        lineDone = true;
                    }
                    else if (c != '\r')
                    {
                        /* Reserve the last slot for the NUL terminator below. */
                        if (s_lineLen < LINE_BUF_SIZE - 1U)
                        {
                            s_lineBuf[s_lineLen++] = c;
                        }
                        else
                        {
                            lineDone = true; /* overflow: treat as a (too-long) line so we reply and reset */
                        }
                    }
                }

                if (lineDone)
                {
                    /* NUL-terminate so the hand-rolled hex/decimal parsers in
                     * process_command() stop at the real end of the line
                     * instead of reading stale bytes left over in this
                     * static buffer from a previous, longer command. */
                    s_lineBuf[s_lineLen] = '\0';
                    s_lineReady           = true; /* APPTask() will reply, then re-arm the next receive */
                }
                else
                {
                    error = USB_DeviceCdcAcmRecv(handle, USB_CDC_VCOM_BULK_OUT_ENDPOINT, s_currRecvBuf,
                                                  g_UsbDeviceCdcVcomDicEndpoints[1].maxPacketSize);
                }
            }
            break;
        case kUSB_DeviceCdcEventSerialStateNotif:
            ((usb_device_cdc_acm_struct_t *)handle)->hasSentState = 0;
            error                                                 = kStatus_USB_Success;
            break;
        case kUSB_DeviceCdcEventSendEncapsulatedCommand:
        case kUSB_DeviceCdcEventGetEncapsulatedResponse:
            break;
        case kUSB_DeviceCdcEventSetCommFeature:
            if (USB_DEVICE_CDC_FEATURE_ABSTRACT_STATE == acmReqParam->setupValue)
            {
                if (1U == acmReqParam->isSetup)
                {
                    *(acmReqParam->buffer) = s_abstractState;
                    *(acmReqParam->length) = sizeof(s_abstractState);
                }
                error = kStatus_USB_Success;
            }
            else if (USB_DEVICE_CDC_FEATURE_COUNTRY_SETTING == acmReqParam->setupValue)
            {
                if (1U == acmReqParam->isSetup)
                {
                    *(acmReqParam->buffer) = s_countryCode;
                    *(acmReqParam->length) = sizeof(s_countryCode);
                }
                error = kStatus_USB_Success;
            }
            break;
        case kUSB_DeviceCdcEventGetCommFeature:
            if (USB_DEVICE_CDC_FEATURE_ABSTRACT_STATE == acmReqParam->setupValue)
            {
                *(acmReqParam->buffer) = s_abstractState;
                *(acmReqParam->length) = COMM_FEATURE_DATA_SIZE;
                error                  = kStatus_USB_Success;
            }
            else if (USB_DEVICE_CDC_FEATURE_COUNTRY_SETTING == acmReqParam->setupValue)
            {
                *(acmReqParam->buffer) = s_countryCode;
                *(acmReqParam->length) = COMM_FEATURE_DATA_SIZE;
                error                  = kStatus_USB_Success;
            }
            break;
        case kUSB_DeviceCdcEventClearCommFeature:
            break;
        case kUSB_DeviceCdcEventGetLineCoding:
            *(acmReqParam->buffer) = s_lineCoding;
            *(acmReqParam->length) = LINE_CODING_SIZE;
            error                  = kStatus_USB_Success;
            break;
        case kUSB_DeviceCdcEventSetLineCoding:
            if (1U == acmReqParam->isSetup)
            {
                *(acmReqParam->buffer) = s_lineCoding;
                *(acmReqParam->length) = sizeof(s_lineCoding);
            }
            error = kStatus_USB_Success;
            break;
        case kUSB_DeviceCdcEventSetControlLineState:
        {
            s_usbCdcAcmInfo.dteStatus = acmReqParam->setupValue;
            if (acmInfo->dteStatus & USB_DEVICE_CDC_CONTROL_SIG_BITMAP_CARRIER_ACTIVATION)
            {
                acmInfo->uartState |= USB_DEVICE_CDC_UART_STATE_TX_CARRIER;
            }
            else
            {
                acmInfo->uartState &= (uint16_t)~USB_DEVICE_CDC_UART_STATE_TX_CARRIER;
            }
            if (acmInfo->dteStatus & USB_DEVICE_CDC_CONTROL_SIG_BITMAP_DTE_PRESENCE)
            {
                acmInfo->uartState |= USB_DEVICE_CDC_UART_STATE_RX_CARRIER;
            }
            else
            {
                acmInfo->uartState &= (uint16_t)~USB_DEVICE_CDC_UART_STATE_RX_CARRIER;
            }
            acmInfo->dtePresent = (acmInfo->dteStatus & USB_DEVICE_CDC_CONTROL_SIG_BITMAP_DTE_PRESENCE) ? true : false;

            acmInfo->serialStateBuf[0] = NOTIF_REQUEST_TYPE;
            acmInfo->serialStateBuf[1] = USB_DEVICE_CDC_NOTIF_SERIAL_STATE;
            acmInfo->serialStateBuf[2] = 0x00;
            acmInfo->serialStateBuf[3] = 0x00;
            acmInfo->serialStateBuf[4] = 0x00;
            acmInfo->serialStateBuf[5] = 0x00;
            acmInfo->serialStateBuf[6] = UART_BITMAP_SIZE;
            acmInfo->serialStateBuf[7] = 0x00;
            acmInfo->serialStateBuf[4] = acmReqParam->interfaceIndex;
            uartBitmap    = (uint8_t *)&acmInfo->serialStateBuf[NOTIF_PACKET_SIZE + UART_BITMAP_SIZE - 2];
            uartBitmap[0] = acmInfo->uartState & 0xFFu;
            uartBitmap[1] = (acmInfo->uartState >> 8) & 0xFFu;

            len = (uint32_t)(NOTIF_PACKET_SIZE + UART_BITMAP_SIZE);
            if (0U == ((usb_device_cdc_acm_struct_t *)handle)->hasSentState)
            {
                error = USB_DeviceCdcAcmSend(handle, USB_CDC_VCOM_INTERRUPT_IN_ENDPOINT, acmInfo->serialStateBuf, len);
                if (kStatus_USB_Success != error)
                {
                    rtt_puts("kUSB_DeviceCdcEventSetControlLineState error!\r\n");
                }
                ((usb_device_cdc_acm_struct_t *)handle)->hasSentState = 1;
            }

            if (1U == s_cdcVcom.attach)
            {
                s_cdcVcom.startTransactions = 1;
                rtt_puts("host opened the port\r\n");
            }
            error = kStatus_USB_Success;
        }
        break;
        case kUSB_DeviceCdcEventSendBreak:
            break;
        default:
            break;
    }

    return error;
}

